{
  "backend/main.mo": "Defines the actor with authorization/storage mixins and a large set of shared types for profiles, budgets, households, reminders, wellbeing, fitness, meals, shopping lists, achievements, and chat.",
  "feature_evidence.json": "Feature evidence report listing features, associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend components and utilities.",
  "frontend/index.css": "Tailwind base styles plus theme variables for light and dark modes using an OKLCH color system.",
  "frontend/index.html": "HTML entry point defining root element, metadata, favicon, and script loading for the app.",
  "frontend/src/App.tsx": "Main React app component handling authentication flow, profile loading, onboarding, and rendering the app layout.",
  "frontend/src/components/achievements/AchievementsScreen.tsx": "UI for the achievements module showing placeholder achievements with a notice that backend support is not implemented.",
  "frontend/src/components/auth/LoginScreen.tsx": "Login screen using Internet Identity with branded hero section, login card, and adult-age notice.",
  "frontend/src/components/budget/BudgetEntriesEditor.tsx": "Manages adding, deleting, and persisting income/expense entries in localStorage and reports totals upward.",
  "frontend/src/components/budget/PersonalBudgetDashboard.tsx": "Displays budget summary, progress, and a form to update budget values while integrating BudgetEntriesEditor.",
  "frontend/src/components/community/chat/GlobalChatPanel.tsx": "Renders global chat with message fetch/send, error handling, scrolling, and message input.",
  "frontend/src/components/community/chat/HouseholdChatPanel.tsx": "Displays household chat with special handling for users not in a household and supports sending messages.",
  "frontend/src/components/community/chat/MessageRow.tsx": "Shows a single chat message with avatar, timestamp, and admin/flagging controls.",
  "frontend/src/components/community/chat/PrivateMessagesPanel.tsx": "Displays private conversations, loads messages, supports sending and pausing chats, and handles backend unavailability.",
  "frontend/src/components/community/chat/StaffGroupChatPanel.tsx": "Admin‑only group chat panel that loads staff messages, sends new ones, and shows an error if backend is unavailable.",
  "frontend/src/components/community/CommunityModule.tsx": "Provides tabbed navigation for global, private, household, and admin-only staff chats.",
  "frontend/src/components/household/HouseholdDashboard.tsx": "Household dashboard showing invites, an invite panel, and placeholder sections pending backend integration.",
  "frontend/src/components/household/HouseholdInvitePanel.tsx": "Form for sending household invitations using a mutation hook with success and error toasts.",
  "frontend/src/components/household/PendingInvitesList.tsx": "Lists incoming household invites with accept and decline actions using mutation hooks.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout managing navigation, view switching, theming, and logout across many feature modules.",
  "frontend/src/components/meal-planning/MealPlanningModule.tsx": "UI for creating and viewing meal plans with placeholder messaging due to missing backend support.",
  "frontend/src/components/memberships/MembershipCheckerModule.tsx": "Membership tracking module with disclaimer and placeholders until backend storage and analysis exist.",
  "frontend/src/components/profile/AvatarUploader.tsx": "Handles image file validation and uploads a profile picture with progress tracking.",
  "frontend/src/components/profile/OnboardingFlow.tsx": "Collects user info for initial profile creation and validates age before submitting.",
  "frontend/src/components/profile/ProfileSettings.tsx": "Displays and updates user profile details, including avatar upload and private information.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar image or fallback initials based on provided data.",
  "frontend/src/components/reminders/RenewalRemindersModule.tsx": "UI for managing renewal reminders with placeholder alerts for missing backend support.",
  "frontend/src/components/savings-coach/SavingsCoachModule.tsx": "Provides savings guidance UI and notes pending backend functionality.",
  "frontend/src/components/shopping/ShoppingListsModule.tsx": "UI for creating and viewing shopping lists with backend not yet implemented.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Manages theme state and toggling between light and dark modes using context.",
  "frontend/src/components/wellbeing/WellbeingFitnessModule.tsx": "UI for wellbeing tracking with tabs for BMI, goals, and activities; backend not yet implemented.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity with query invalidation.",
  "frontend/src/hooks/useChat.ts": "Provides React Query hooks for global and private chat operations, including fetching messages, sending messages, and managing conversation status with polling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login state, identity loading, and providing a provider wrapper.",
  "frontend/src/hooks/useModeration.ts": "Defines moderation hooks for flagging, fetching, deleting, and resolving messages, with query invalidation and error handling.",
  "frontend/src/hooks/useProfile.ts": "Contains hooks for retrieving and updating user profiles, roles, and profile pictures with React Query caching.",
  "frontend/src/hooks/useQueries.ts": "Offers hooks for budgets, household invites, and public profiles, including fetch and mutation helpers with cache invalidation.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines a warm color theme with custom variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/staff/StaffDirectory.tsx": "Displays a staff-only table of all users with avatars, private details, age calculation, and adult status badges.",
  "frontend/src/pages/staff/StaffModeration.tsx": "Provides admin-only tools to review, resolve, and delete flagged messages with tabbed views and error handling.",
  "frontend/src/utils/age.ts": "Utility functions for calculating age, checking adulthood, and validating date-of-birth values.",
  "frontend/src/utils/backendErrors.ts": "Maps backend error messages to cleaner, user-friendly error text.",
  "frontend/src/utils/storageKeys.ts": "Manages localStorage keys for user budget data and provides a helper to clear stored entries.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Stores project metadata, active features, known issues, and incremental development goals for backend/UI integration and messaging features."
}